Repository: EcoSys-365/easy-stripe-payments
Catalog: languages/easy-stripe-payments-*.po
Languages: de_de

source: You can define custom metadata such as campaign_id, project_name, or product_name to help track your payments more effectively.
de_de: Sie können benutzerdefinierte Metadaten wie campaign_id, project_name oder product_name definieren, um Ihre Zahlungen effektiver nachzuverfolgen.

source: Stripe Metadata:
de_de: Stripe Metadaten:

source: E.g. 5872
de_de: Beispiel: 5872

source: E.g. Winter Campaign
de_de: Beispiel: Winterkampagne

source: E.g. Blue Hoodie
de_de: Beispiel: Blauer Hoodie

source: Save Form
de_de: Formular speichern

source: These currencies are accepted by Stripe
de_de: Diese Währungen werden von Stripe akzeptiert

source: Select a language for the Checkout Form
de_de: Wählen Sie eine Sprache für das Checkout-Formular aus

source: Overview
de_de: Übersicht

source: Recurring Payments
de_de: Abonnementzahlungen

source: Premium is active
de_de: Premium ist aktiv

source: Your domain is registered.
de_de: Ihre Domain ist registriert.

source: No Premium – inactive
de_de: Kein Premium – inaktiv

source: Your domain is not registered.
de_de: Ihre Domain ist nicht registriert.

source: City
de_de: Stadt

source: Phone number
de_de: Telefonnummer

source: Please enter your <b>Stripe Public Key</b> &amp; <b>Stripe Secret Key</b> in the <a href="%s">Settings</a> section.
de_de: Bitte geben Sie Ihren <b>Stripe Public Key</b> &amp; <b>Stripe Secret Key</b> im Bereich <a href="%s">Einstellungen</a> ein.

source: Our Goal
de_de: Unser Ziel

source: Amount Raised
de_de: Gesammelter Betrag

source: Enter amount
de_de: Betrag eingeben

source: Protected payment powered by Stripe
de_de: Geschützte Zahlung, powered by Stripe

source: Full name
de_de: Vollständiger Name

source: Street &amp; No.
de_de: Straße &amp; Nummer

source: Postal code
de_de: Postleitzahl

source: Settings saved.
de_de: Einstellungen gespeichert.

source: Successfully connected to Stripe
de_de: Erfolgreich mit Stripe verbunden

source: Stripe Settings
de_de: Stripe-Einstellungen

source: Stripe Public Key
de_de: Stripe öffentlicher Schlüssel

source: Stripe Secret Key
de_de: Stripe privater Schlüssel

source: 1. Provide Stripe Public Key &amp Stripe Private Key
de_de: 1. Geben Sie den öffentlichen und privaten Stripe-Schlüssel an.

source: 2. Create a Payment Form ( Checkout Form or Campaign Form )
de_de: 2. Erstellen Sie ein Formular für die Zahlung (Checkout-Formular oder Kampagnenformular)

source: 2.1 Testing purposes: Choose your form in the "Preview" section
de_de: 2.1 Zu Testzwecken: Wählen Sie Ihr Formular im Bereich „Vorschau“ aus.

source: 3. Create a Stripe Product for recurring Payments
de_de: 3. Erstellen Sie ein Stripe-Produkt für wiederkehrende Zahlungen.

source: 3.1 Testing purposes: Click the button to test your product. You will be redirected to Stripe’s secure hosted Checkout page
de_de: 3.1 Zu Testzwecken: Klicken Sie auf die Schaltfläche, um Ihr Produkt zu testen. Sie werden zur sicheren, gehosteten Checkout-Seite von Stripe weitergeleitet.

source: 4. Add the shortcodes to the appropriate page
de_de: 4. Fügen Sie die Shortcodes auf der entsprechenden Seite hinzu.

source: 5. Register your domain and get priority support &amp; access to Multiple Stripe Checkouts, Multiple Subscription Payments &amp; Stripe Metadata
de_de: 5. Registrieren Sie Ihre Domain und erhalten Sie bevorzugten Support sowie Zugriff auf mehrere Stripe-Checkouts, mehrere Abonnementzahlungen &amp; Stripe-Metadaten.

source: Stripe is not a traditional bank account, but a Payment Gateway. This means: Funds from customer payments are not stored permanently in a Stripe balance account. Instead, available amounts are automatically transferred to your linked bank account through what are called payouts.
de_de: Stripe ist keine traditionelle Bank, sondern ein Zahlungs-Gateway. Das bedeutet: Gelder aus Kundenzahlungen werden nicht dauerhaft auf einem Stripe-Guthabenkonto gespeichert. Stattdessen werden verfügbare Beträge über sogenannte Auszahlungen automatisch auf Ihr verknüpftes Bankkonto überwiesen.

source: Stripe overview
de_de: Stripe Übersicht

source: Available balance
de_de: Verfügbares Guthaben

source: Pending balance
de_de: Ausstehendes Guthaben

source: Stripe subscriptions
de_de: Stripe-Abonnements

source: Total Stripe products
de_de: Gesamtzahl der Stripe-Produkte

source: Active Stripe products
de_de: Aktive Stripe Produkte

source: Inactive Stripe products
de_de: Inaktive Stripe Produkte

source: Failed Payments
de_de: Fehlgeschlagene Zahlungen

source: Total number of Stripe customers
de_de: Gesamtzahl der Stripe-Kunden

source: Invalid payment form ID.
de_de: Ungültige Zahlungsformular-ID.

source: Invalid payment product ID.
de_de: Ungültige Zahlungsprodukt-ID.

source: Stripe Payments
de_de: Stripe Zahlungen

source: Overview &#10024;
de_de: Übersicht &#10024;

source: Payments &#128176;
de_de: Zahlungen &#128176;

source: Settings &#128295;
de_de: Einstellungen &#128295;

source: Help &amp; FAQ &#10068;
de_de: Hilfe &amp; FAQ &#10068;

source: Stripe Subscription Product &amp; Button
de_de: Stripe Abonnement-Produkt &amp; Button

source: Stripe Campaign Checkout
de_de: Stripe Kampagnen Checkout

source: Payment failed
de_de: Zahlung fehlgeschlagen

source: Your payment has failed. Please contact us.
de_de: Ihre Zahlung ist fehlgeschlagen. Bitte kontaktieren Sie uns.

source: Payment is still pending
de_de: Zahlung ist noch ausstehend

source: This page will refresh automatically in 10 seconds. Please wait.
de_de: Diese Seite wird in 10 Sekunden automatisch aktualisiert. Bitte warten Sie.

source: Payment successful
de_de: Zahlung erfolgreich

source: Telephone:
de_de: Telefon:

source: Address:
de_de: Adresse:

source: Amount:
de_de: Betrag:

source: Method:
de_de: Methode:

source: Payment has already been processed
de_de: Die Zahlung wurde bereits bearbeitet.

source: Your subscription has been successfully created
de_de: Ihre Abonnementzahlung wurde erfolgreich erstellt.

source: Domain is not registered
de_de: Domain ist nicht registriert

source: Register now
de_de: Jetzt registrieren

source: Active Stripe payment methods for Subscription Payments:
de_de: Aktive Stripe-Zahlungsmethoden für Abonnementzahlungen:

source: You can manage these in your Stripe Dashboard.
de_de: Sie können diese in Ihrem Stripe-Dashboard verwalten.

source: Easily accept payments with three flexible Stripe options
de_de: Akzeptieren Sie Zahlungen einfach mit drei flexiblen Stripe-Optionen

source: 2. Campaign-based payments with built-in Stripe Checkout
de_de: 2. Kampagnenbasierte Zahlungen mit integriertem Stripe Checkout

source: 3. Recurring payments via button and redirect to Stripe’s secure hosted Checkout page
de_de: 3. Wiederkehrende Zahlungen per Button und Weiterleitung zur sicheren, gehosteten Checkout-Seite von Stripe

source: Don\'t miss this opportunity - We\'re currently offering <b class='green'>a 20% discount!</b>
de_de: Verpassen Sie diese Gelegenheit nicht - Wir bieten Ihnen derzeit <b class='green'>20 % Rabatt!</b>

source: Welcome to Easy Stripe Payments &amp; Donations!
de_de: Willkommen zu Easy Stripe Payments &amp; Donations!

source: Thank you for installing Easy Stripe Payments &amp; Donations.
de_de: Vielen Dank für die Installation von Easy Stripe Payments &amp; Donations.

source: With this plugin, you can set up secure Stripe payments on your website in just a few minutes — no coding skills required. Choose from three flexible checkout options: simple payment forms, campaign forms &amp; subscription payments.
de_de: Mit diesem Plugin können Sie in wenigen Minuten sichere Stripe-Zahlungen auf Ihrer Website einrichten – keine Programmierkenntnisse erforderlich. Wählen Sie aus drei flexiblen Checkout-Optionen: einfache Zahlungsformulare, Kampagnenformulare und Abonnementzahlungen.

source: Tip: The <a href="%1$s" target="_blank">%2$s</a> includes a step-by-step walkthrough to help you get started in just a few minutes.
de_de: Tipp: Die <a href="%1$s" target="_blank">%2$s</a> enthält eine Schritt-für-Schritt-Anleitung, die Ihnen den Einstieg in wenigen Minuten erleichtert.

source: Setup Guide
de_de: Einrichtungsanleitung

source: Wishing you great success and secure payments with Easy Stripe Payments &amp; Donations!
de_de: Wir wünschen Ihnen viel Erfolg und sichere Zahlungen mit Easy Stripe Payments &amp; Donations!

source: Premium Members receive additional features and access to priority support, while <b class="blue">all core functionality remains freely available.</b><br /><br />&#128274; <b>Want to get even more out of it?</b><br />Become a Premium &#x1F48E; Member for Multiple Stripe Checkouts, Multiple Subscription Payments &amp; Stripe Metadata.
de_de: Premium-Mitglieder erhalten zusätzliche Funktionen und Zugang zu bevorzugtem Support, während <b class="blue">alle Kernfunktionen weiterhin kostenlos verfügbar sind.</b><br /><br />&#128274; <b>Du möchtest noch mehr herausholen?</b><br />Werde Premium &#x1F48E; Mitglied für mehrere Stripe-Checkouts, mehrere Abonnementzahlungen &amp; Stripe-Metadaten.

source: Check out the Demo Campaign under the Payment Forms tab and see a live preview in the Preview section – you can even run a test payment there to experience the full payment flow, including the confirmation Email. The Checkout Form ID is also stored as Stripe metadata for each payment, so you can later assign payments to the corresponding form.
de_de: Sehen Sie sich die Demo-Kampagne unter dem Tab "Zahlungsformulare" an und nutzen Sie die Live-Vorschau im Bereich "Vorschau" – dort können Sie sogar eine Testzahlung durchführen, um den gesamten Zahlungsablauf inklusive der Bestätigungs-E-Mail zu erleben. Die Checkout-Formular-ID wird zudem als Stripe-Metadaten für jede Zahlung gespeichert, sodass Sie Zahlungen später dem entsprechenden Formular zuordnen können.

source: Demo content installed successfully
de_de: Demo-Inhalte erfolgreich installiert

source: Become a Member &#x1F48E; now &amp;<br />unlock your exclusive discount!
de_de: Jetzt Mitglied &#x1F48E; werden &amp;<br />Ihren exklusiven Rabatt sichern!

source: Plugin not connected to Stripe
de_de: Plugin nicht mit Stripe verbunden

source: To accept payments with Stripe, you need to connect your Stripe account.
de_de: Um Zahlungen mit Stripe zu akzeptieren, müssen Sie Ihr Stripe-Konto verbinden.

source: Connect to Stripe now
de_de: Jetzt mit Stripe verbinden

source: No payment method selected.
de_de: Keine Zahlungsmethode ausgewählt.

source: No session_id supported.
de_de: Keine session_id gefunden.

source: No invoice found.
de_de: Keine Rechnung gefunden.
