Repository: EcoSys-365/easy-stripe-payments
Catalog: languages/easy-stripe-payments-*.po
Languages: de_de

source: Easy Stripe Payments and Donations
de_de: Einfache Stripe-Zahlungen und Spenden

source: A user-friendly WordPress plugin for accepting <strong>one-time and recurring Stripe payments</strong>. Perfect for businesses, freelancers and Non-Profit organizations. Secure, fast and fully PCI-compliant.
de_de: Ein benutzerfreundliches WordPress-Plugin für die Annahme von <strong>einmaligen und wiederkehrenden Stripe-Zahlungen</strong>. Perfekt für Unternehmen, Freiberufler und Non-Profit-Organisationen. Sicher, schnell und vollständig PCI-konform.

source: Your domain is not registered
de_de: Ihre Domain ist nicht registriert

source: Sign up now and enjoy unlimited forms, unlimited Stripe subscription buttons and your exclusive discount!
de_de: Melden Sie sich jetzt an und genießen Sie unbegrenzte Formulare, unbegrenzte Stripe-Abonnement-Buttons und Ihren exklusiven Rabatt!

source: Register your domain
de_de: Registrieren Sie Ihre Domain

source: Premium members gain access to advanced features such as priority support and enhanced Stripe payment workflows, while all core functionality remains freely available.
de_de: Premium-Mitglieder erhalten Zugang zu erweiterten Funktionen wie vorrangigem Support und verbesserten Stripe-Zahlungsabläufen, während alle Kernfunktionen frei verfügbar bleiben.

source: Payment Forms
de_de: Bezahlformulare

source: Add Standard Checkout
de_de: Standard-Checkout hinzufügen

source: Add Campaign Checkout
de_de: Kampagnen-Checkout hinzufügen

source: Form Name
de_de: Formular Name

source: Mode
de_de: Modus

source: Fix Amount
de_de: Fixer Betrag

source: Currency
de_de: Währung

source: Description
de_de: Beschreibung

source: Edit
de_de: Bearbeiten

source: Delete
de_de: Löschen

source: Preview
de_de: Vorschau

source: Copy
de_de: Kopieren

source: No forms have been created yet.
de_de: Es wurden keine Formulare erstellt.

source: Help &amp; FAQ
de_de: Hilfe &amp; FAQ

source: Please copy and paste the following system information into your support email to
de_de: Bitte kopieren Sie die folgenden Systeminformationen und fügen Sie sie in Ihre Support-E-Mail ein:

source: This helps us troubleshoot your issue faster.
de_de: Das hilft uns, Ihr Problem schneller zu beheben.

source: Copy to Clipboard
de_de: In die Zwischenablage kopieren

source: How do I connect my Stripe account?
de_de: Wie verbinde ich mein Stripe-Konto?

source: Go to the plugin settings and enter your Stripe Public Key and Stripe Secret Key.
de_de: Gehe zu den Plugin-Einstellungen und gib deinen Stripe Public Key sowie deinen Stripe Secret Key ein.

source: Test Payments ( Stripe Sandbox )
de_de: Testzahlungen (Stripe Sandbox)

source: You can test credit card payments using the following test data:
de_de: Du kannst Kreditkartenzahlungen mit den folgenden Testdaten testen:

source: Card Number:
de_de: Kartennummer:

source: Expiration date:
de_de: Ablaufdatum:

source: future valid date
de_de: ein zukünftiges gültiges Datum

source: or any number
de_de: oder eine beliebige Nummer

source: Stripe Test Card Numbers
de_de: Stripe Testkartennummern

source: How are sensitive Stripe API keys stored in this plugin?
de_de: Wie werden sensible Stripe API-Schlüssel in diesem Plugin gespeichert?

source: Your Stripe keys are securely encrypted and stored in your own WordPress database, on the site where the plugin is installed. At no point are these keys shared with any third party.
de_de: Deine Stripe-Schlüssel werden sicher verschlüsselt in deiner eigenen WordPress-Datenbank gespeichert, also auf der Seite, auf der das Plugin installiert ist. Zu keinem Zeitpunkt werden diese Schlüssel an Dritte weitergegeben.

source: Security and trust are extremely important to us. We understand the responsibility that comes with handling sensitive data. That’s why we’ve built the plugin in a way that ensures unauthorized access is not possible.
de_de: Sicherheit und Vertrauen sind uns äußerst wichtig. Wir sind uns der Verantwortung bewusst, die mit dem Umgang sensibler Daten einhergeht. Deshalb haben wir das Plugin so entwickelt, dass ein unbefugter Zugriff ausgeschlossen ist.

source: All settings and credentials exist strictly within the plugin’s own namespace, following best practices in the WordPress ecosystem to prevent interference or data leaks.
de_de: Alle Einstellungen und Zugangsdaten befinden sich ausschließlich im eigenen Namensraum des Plugins und folgen den Best Practices im WordPress-Ökosystem, um Interferenzen oder Datenlecks zu verhindern.

source: How do I receive payments?
de_de: Wie erhalte ich Zahlungen?

source: Payments are deposited directly into your Stripe account. You can manage payouts in your Stripe Dashboard.
de_de: Zahlungen werden direkt auf dein Stripe-Konto eingezahlt. Auszahlungen kannst du in deinem Stripe-Dashboard verwalten.

source: Can I use test mode and live mode at the same time?
de_de: Kann ich den Testmodus und den Live-Modus gleichzeitig verwenden?

source: No, you can only have one mode active at a time — either test or live. You can switch the mode using the Stripe Public and Secret Keys in the plugin settings.
de_de: Nein, du kannst immer nur einen Modus aktiv haben – entweder den Testmodus oder den Live-Modus. Den Modus kannst du über die Stripe Public und Secret Schlüssel in den Plugin-Einstellungen wechseln.

source: Which currencies are supported?
de_de: Welche Währungen werden unterstützt?

source: The plugin supports all currencies supported by your
de_de: Das Plugin unterstützt alle Währungen, die von deinem

source: account. Please note that your connected bank account must also be compatible with the currency.
de_de: Konto angeboten werden. Bitte beachte, dass dein verbundenes Bankkonto ebenfalls mit der Währung kompatibel sein muss.

source: Can I create recurring payments ( Subscriptions )?
de_de: Kann ich wiederkehrende Zahlungen (Abonnements) erstellen?

source: Yes, the plugin supports Stripe subscriptions. You can configure these ( Recurring Payments ) via product settings with intervals like "monthly" or "yearly."
de_de: Ja, das Plugin unterstützt Stripe-Abonnements. Du kannst diese (wiederkehrenden Zahlungen) über die Produkteinstellungen mit Intervallen wie „monatlich“ oder „jährlich“ konfigurieren.

source: How secure is the plugin?
de_de: Wie sicher ist das Plugin?

source: All payments are processed directly through the Stripe API. The plugin does not store any sensitive payment data on your server. Additionally, recommended WordPress security measures like nonces, sanitizing and prepared statements are implemented.
de_de: Alle Zahlungen werden direkt über die Stripe API verarbeitet. Das Plugin speichert keine sensiblen Zahlungsdaten auf deinem Server. Zudem sind empfohlene WordPress-Sicherheitsmaßnahmen wie Nonces, Datenbereinigung und vorbereitete Statements implementiert.

source: What happens if I uninstall the plugin?
de_de: Was passiert, wenn ich das Plugin deinstalliere?

source: On normal deactivation, your Stripe connections and settings – including your encrypted API keys – remain stored in the database. A complete deletion via the plugin overview page will remove all plugin data.
de_de: Bei einer normalen Deaktivierung bleiben deine Stripe-Verbindungen und Einstellungen – einschließlich deiner verschlüsselten API-Schlüssel – in der Datenbank gespeichert. Eine vollständige Löschung über die Plugin-Übersichtsseite entfernt alle Plugin-Daten.

source: How can I issue refunds?
de_de: Wie kann ich Rückerstattungen durchführen?

source: Refunds must be made directly through the Stripe dashboard. The plugin currently does not offer an in-plugin refund feature.
de_de: Rückerstattungen müssen direkt über das Stripe-Dashboard vorgenommen werden. Das Plugin bietet derzeit keine Rückerstattungsfunktion innerhalb des Plugins an.

source: How do I troubleshoot payment failures?
de_de: Wie behebe ich Zahlungsfehler?

source: Check your Stripe dashboard for detailed error messages. Common reasons include invalid API keys, currency mismatches, or card declines. Make sure your keys are correct and the plugin is in the correct mode ( Test / Live ).
de_de: Überprüfe dein Stripe-Dashboard auf detaillierte Fehlermeldungen. Häufige Ursachen sind ungültige API-Schlüssel, Währungsinkompatibilitäten oder abgelehnte Karten. Stelle sicher, dass deine Schlüssel korrekt sind und das Plugin im richtigen Modus (Test / Live) läuft.

source: Can I customize the Checkout payment form?
de_de: Kann ich das Checkout-Zahlungsformular anpassen?

source: Yes, the plugin offers options to customize labels, button texts, payment types, images, campaigns, appearance, Stripe Metadata etc.
de_de: Ja, das Plugin bietet Optionen zur Anpassung von Beschriftungen, Button-Texten, Zahlungsmethoden, Bildern, Kampagnen, dem Erscheinungsbild, Stripe-Metadaten und mehr.

source: Is PCI compliance handled by the plugin?
de_de: Wird die PCI-Konformität vom Plugin übernommen?

source: Stripe handles all sensitive payment data, so PCI compliance burden on your server is minimal. However, you should still follow best practices for website security.
de_de: Stripe übernimmt alle sensiblen Zahlungsdaten, daher ist die PCI-Konformität auf deinem Server minimal. Dennoch solltest du weiterhin die besten Sicherheitspraktiken für deine Webseite einhalten.

source: Can I accept payments in multiple currencies?
de_de: Kann ich Zahlungen in mehreren Währungen akzeptieren?

source: You can accept payments in any currency supported by your Stripe account. Ensure your products and pricing are set up accordingly.
de_de: Du kannst Zahlungen in jeder Währung akzeptieren, die von deinem Stripe-Konto unterstützt wird. Stelle sicher, dass deine Produkte und Preise entsprechend eingerichtet sind.

source: Does the plugin support Apple Pay, Google Pay, PayPal, Alipay etc.?
de_de: Unterstützt das Plugin Apple Pay, Google Pay, PayPal, Alipay usw.?

source: Yes, plugin users can manage all payment methods directly through their Stripe Dashboard and these will be automatically displayed on the website’s checkout form.
de_de: Ja, Plugin-Nutzer können alle Zahlungsmethoden direkt über ihr Stripe-Dashboard verwalten, und diese werden automatisch im Checkout-Formular der Website angezeigt.

source: All Stripe Payment Methods
de_de: Alle Stripe-Zahlungsmethoden

source: Can I connect the plugin to multiple different Stripe accounts?
de_de: Kann ich das Plugin mit mehreren verschiedenen Stripe-Konten verbinden?

source: Yes, that is possible. However, we recommend fully deleting the plugin using the delete function on the plugin overview page before connecting it to a different Stripe account. Otherwise, inconsistencies with the database (payments, subscription buttons, etc.) may occur.
de_de: Ja, das ist möglich. Wir empfehlen jedoch, das Plugin mit der Löschfunktion auf der Plugin-Übersichtsseite vollständig zu löschen, bevor Sie es mit einem anderen Stripe-Konto verbinden. Andernfalls kann es zu Inkonsistenzen mit der Datenbank (Zahlungen, Abo-Buttons etc.) kommen.

source: Can my Premium Membership be revoked under certain conditions?
de_de: Kann meine Premium-Mitgliedschaft unter bestimmten Bedingungen widerrufen werden?

source: Yes. We reserve the right to terminate a premium membership without refund if a website using our plugin contains illegal, prohibited or content we deem morally unacceptable.
de_de: Ja. Wir behalten uns das Recht vor, eine Premium-Mitgliedschaft ohne Rückerstattung zu beenden, wenn eine Website, die unser Plugin verwendet, illegale, verbotene oder von uns als moralisch inakzeptabel angesehene Inhalte enthält.

source: We do not support the use of our plugin on websites that promote hate, violence, discrimination or any content that violates applicable laws or our ethical standards. If such content is detected, we may suspend or revoke access to premium features at any time, without prior notice and without a refund.
de_de: Wir unterstützen nicht die Verwendung unseres Plugins auf Websites, die Hass, Gewalt, Diskriminierung oder andere Inhalte fördern, die gegen geltende Gesetze oder unsere ethischen Standards verstoßen. Wenn solche Inhalte entdeckt werden, können wir den Zugang zu den Premium-Funktionen jederzeit ohne vorherige Ankündigung und ohne Rückerstattung aussetzen oder widerrufen.

source: We encourage all users to ensure that their websites align with legal standards and basic ethical principles. If you are unsure whether your content meets these guidelines, feel free to contact us in advance.
de_de: Wir ermutigen alle Nutzer, dafür zu sorgen, dass ihre Websites mit den rechtlichen Standards und den grundlegenden ethischen Prinzipien übereinstimmen. Wenn Sie sich nicht sicher sind, ob Ihr Inhalt diesen Richtlinien entspricht, können Sie uns gerne im Voraus kontaktieren.

source: Do you, as the plugin developers, assume liability for payments or the use of the plugin?
de_de: Übernehmen Sie als Plugin-Entwickler die Haftung für Zahlungen oder die Nutzung des Plugins?

source: No. We accept no liability for any damages, outages or losses that may arise from the use of this plugin. The use of the plugin is at your own risk. You are solely responsible for correctly configuring your Stripe settings, monitoring payments and complying with applicable legal and tax regulations. We provide the plugin "as is" without any warranties or guarantees.
de_de: Nein. Wir übernehmen keine Haftung für Schäden, Ausfälle oder Verluste, die durch die Nutzung dieses Plugins entstehen können. Die Verwendung des Plugins erfolgt auf eigenes Risiko. Sie sind allein verantwortlich für die korrekte Konfiguration Ihrer Stripe-Einstellungen, die Überwachung der Zahlungen sowie die Einhaltung der geltenden gesetzlichen und steuerlichen Vorschriften. Wir stellen das Plugin „wie gesehen“ bereit – ohne jegliche Gewährleistung oder Garantie.

source: Successfully saved
de_de: Erfolgreich gespeichert

source: Confirmation Emails
de_de: Bestätigungs-E-Mails

source: Set up confirmation Emails for your users and configure them to be automatically sent upon each successful payment.
de_de: Richten Sie Bestätigungs-E-Mails für Ihre Nutzer ein und konfigurieren Sie diese so, dass sie bei jeder erfolgreichen Zahlung automatisch versendet werden.

source: ✅ Payment Confirmation – Thank You
de_de: ✅ Zahlungsbestätigung – Vielen Dank

source: Enable Email Notification
de_de: E-Mail-Benachrichtigung aktivieren

source: Subject
de_de: Betreff

source: Sender Email
de_de: Absender-E-Mail

source: Mail Content
de_de: E-Mail Inhalt

source: Save
de_de: Speichern

source: Payments
de_de: Zahlungen

source: There are no payments at this time.
de_de: Zurzeit liegen keine Zahlungen vor.

source: Export as CSV
de_de: Als CSV exportieren

source: Amount
de_de: Betrag

source: Contact Details
de_de: Kontaktdaten

source: Payment Method
de_de: Zahlungsmethode

source: Stripe Payment ID
de_de: Stripe-Zahlungs-ID

source: Stripe Metadata
de_de: Stripe-Metadaten

source: Checkout Form ID
de_de: Checkout-Formular-ID

source: Creation Date
de_de: Erstellungsdatum

source: Campaign
de_de: Kampagne

source: Project
de_de: Projekt

source: Product
de_de: Produkt

source: As a Premium &#x1F48E; Member, you'll get <b>Priority Support</b> and access to <b class="blue">Multiple Stripe Checkouts</b>, <b>Multiple Subscription Payments</b> &amp; <b class="blue">Stripe Metadata</b>.<br /><br />Membership is quick &amp; easy — register your website for a full year in minutes.
de_de: Als Premium &#x1F48E; Mitglied erhalten Sie <b>Priorisierten Support</b> sowie Zugriff auf <b class="blue">Mehrere Stripe-Checkouts</b>, <b>Mehrere Abonnementzahlungen</b> &amp; <b class="blue">Stripe-Metadaten</b>.<br /><br />Die Mitgliedschaft ist schnell &amp; einfach — registrieren Sie Ihre Website innerhalb weniger Minuten für ein ganzes Jahr.

source: Premium Membership
de_de: Premium-Mitgliedschaft

source: Check Premium Status
de_de: Premium-Status prüfen

source: Become a Premium Member
de_de: Premium-Mitglied werden

source: Please choose a form
de_de: Bitte Formular auswählen

source: No forms found
de_de: Keine Formulare gefunden

source: Preview Desktop
de_de: Desktop-Vorschau

source: Preview Tablet
de_de: Tablet-Vorschau

source: Preview Mobile
de_de: Mobilgerät-Vorschau

source: Mobile
de_de: Mobilgerät

source: Please enter your Stripe Public Key and Stripe Secret Key
de_de: Bitte geben Sie Ihren Stripe Public Key und Stripe Secret Key ein

source: Settings
de_de: Einstellungen

source: Prices cannot be changed once created — this ensures consistency in billing history and records. If a price needs to change, a new price must be created and assigned to the product. You can manually delete &amp; change a product through the Stripe Dashboard.
de_de: Preise können nach der Erstellung nicht mehr geändert werden — dies gewährleistet die Konsistenz in der Abrechnungshistorie und den Aufzeichnungen. Wenn ein Preis geändert werden muss, muss ein neuer Preis erstellt und dem Produkt zugewiesen werden. Sie können ein Produkt manuell über das Stripe-Dashboard löschen und ändern.

source: Stripe does not allow updating the price of an active product via the API. You can manually delete &amp; change a product through the Stripe Dashboard.
de_de: Stripe erlaubt es nicht, den Preis eines aktiven Produkts über die API zu aktualisieren. Sie können ein Produkt manuell über das Stripe-Dashboard löschen und ändern.

source: Stripe Recurring Payments
de_de: Stripe Abonnementzahlungen

source: Stripe Product
de_de: Stripe Produkt

source: Product Name
de_de: Produktname

source: Image
de_de: Bild

source: Select image
de_de: Bild auswählen

source: Language
de_de: Sprache

source: Price
de_de: Preis

source: Subscription Button Preview
de_de: Abonnement-Button-Vorschau

source: Subscribe
de_de: Abonnieren

source: Button Title
de_de: Button-Titel

source: Button Size
de_de: Button-Größe

source: Small
de_de: Klein

source: Medium
de_de: Mittel

source: Large
de_de: Groß

source: X-Large
de_de: XL

source: XX-Large
de_de: XXL

source: Button Color
de_de: Button-Farbe

source: Font Color
de_de: Schriftfarbe

source: Product created:
de_de: Produkt erstellt:

source: Add new Stripe product
de_de: Neues Stripe-Produkt hinzufügen

source: Product name
de_de: Produkt Name

source: Payment interval
de_de: Zahlungsintervall

source: Monthly
de_de: Monatlich

source: Every 3 months
de_de: Alle 3 Monate

source: Every 6 months
de_de: Alle 6 Monate

source: Annually
de_de: Jährlich

source: Create product
de_de: Produkt erstellen

source: Product ID
de_de: Produkt ID

source: Subscription Button
de_de: Abonnement-Button

source: View
de_de: Ansicht

source: No image choosed
de_de: Kein Bild ausgewählt

source: No products added yet.
de_de: Noch keine Produkte hinzugefügt.

source: This field can be left empty depending on the selected amount type
de_de: Dieses Feld kann je nach ausgewähltem Betragstyp leer gelassen werden

source: Fixed amount e.g.: 50 $ Variable amount is entered by the user. Select amount e.g.: 100 $, 200 $, 300 $, 400 $, 500 $ After saving the form, you can check it in the preview.
de_de: Fester Betrag, z. B.: 50 $ Variabler Betrag wird vom Nutzer eingegeben. Wählen Sie einen Betrag, z. B.: 100 $, 200 $, 300 $, 400 $, 500 $ Nach dem Speichern des Formulars können Sie es in der Vorschau überprüfen.

source: Amount type
de_de: Betragstyp

source: Variable Amount
de_de: Variabler Betrag

source: Select Amount
de_de: Betrag auswählen

source: Select &amp; Variable Amount
de_de: Auswahlbetrag &amp; variabler Betrag

source: Please select a price list
de_de: Bitte Preisliste auswählen

source: Select how the available payment methods are displayed in the Checkout Form. Choose (Auto) to let Stripe optimize the layout based on the user's device and context.
de_de: Wählen Sie aus, wie die verfügbaren Zahlungsmethoden im Checkout-Formular angezeigt werden sollen. Wählen Sie (Auto), damit Stripe das Layout basierend auf dem Gerät und Kontext des Nutzers optimiert.

source: Payment Layout
de_de: Zahlungs-Layout

source: Auto – Stripe selects the layout
de_de: Automatisch – Stripe bestimmt das Layout

source: Tabs – Payment methods as tabs
de_de: Tabs – Zahlungsmethoden als Registerkarten

source: Accordion – Collapsible sections
de_de: Akkordeon – Zusammenklappbare Abschnitte

source: Customize your button text
de_de: Button-Text anpassen

source: Pay
de_de: Zahlen

source: Donate
de_de: Spenden

source: Book
de_de: Buchen

source: Choose the fields you want to display in the Checkout Form. Name &amp; Email are always required fields, as this information is mandatory for Stripe to handle payments.
de_de: Wählen Sie die Felder aus, die im Checkout-Formular angezeigt werden sollen. Name & E-Mail sind stets Pflichtfelder, da diese Informationen für Stripe zur Zahlungsabwicklung erforderlich sind.

source: Show Fields
de_de: Felder anzeigen

source: Name &amp; Email (Required fields)
de_de: Name &amp; E-Mail (Pflichtfelder)

source: Name &amp; Email &amp; Full Address
de_de: Name &amp; Email &amp; Vollständige Adresse

source: Name &amp; Email &amp; Full Address &amp; Telephone
de_de: Name &amp; E-Mail &amp; Vollständige Adresse &amp; Telefon

source: Name &amp; Email &amp; Full Address (Required fields)
de_de: Name &amp; E-Mail &amp; Vollständige Adresse (Pflichtfelder)

source: Name &amp; Email &amp; Full Address &amp; Telephone (Required fields)
de_de: Name &amp; E-Mail &amp; Vollständige Adresse &amp; Telefon (Pflichtfelder)

source: Color
de_de: Farbe

source: Choose a color for the Checkout Form
de_de: Wählen Sie eine Farbe für das Checkout-Formular

source: Set the current amount for the campaign, or leave this field empty to start from zero. This value is automatically updated in the database after each successful payment. If necessary, you can manually override the current database value from here.
de_de: Legen Sie den aktuellen Betrag für die Kampagne fest, oder lassen Sie dieses Feld leer, um bei null zu starten. Dieser Wert wird nach jeder erfolgreichen Zahlung automatisch in der Datenbank aktualisiert. Bei Bedarf können Sie den aktuellen Datenbankwert hier manuell überschreiben.

source: Campaign Current Amount
de_de: Aktueller Kampagnenbetrag

source: Campaign Goal Amount
de_de: Zielbetrag der Kampagne

source: Enter the target amount for this campaign, or leave it empty to hide the progress bar.
de_de: Geben Sie den Zielbetrag für diese Kampagne ein oder lassen Sie das Feld leer, um die Fortschrittsanzeige auszublenden.

source: Stripe will redirect the user to the specified landing page after the payment process.
de_de: Stripe leitet den Nutzer nach dem Zahlungsprozess auf die angegebene Zielseite weiter.

source: Success URL
de_de: Erfolgs-URL

source: You can leave this field empty or define your own landing page
de_de: Sie können dieses Feld leer lassen oder Ihre eigene Zielseite festlegen

source: Cancel URL
de_de: Abbruch-URL

source: You can define custom metadata such as campaign_id, project_name, or product_name to help track your payments more effectively. E.g. campaign_id: 5872, project_name: Winter Campaign, product_name: Blue Hoodie You can fill out any combination of the three metadata fields, or just one, depending on your needs. The metadata will be saved in Stripe accordingly for each payment.
de_de: Sie können benutzerdefinierte Metadaten wie campaign_id, project_name oder product_name definieren, um Ihre Zahlungen effektiver zu verfolgen. Beispiel: campaign_id: 5872, project_name: Winterkampagne, product_name: Blauer Hoodie Sie können eine beliebige Kombination der drei Metadatenfelder ausfüllen oder nur eines, je nach Bedarf. Die Metadaten werden entsprechend für jede Zahlung in Stripe gespeichert.
